app/controllers/issues_controller.rb

SELECT "issues".* FROM "issues"
---
  def index
    if params[:workflow]
      @issues = Issue.where('workflow=?', params[:workflow])
    elsif params[:user_id]
      @issues = Issue.where('user_id=?', params[:user_id])
    elsif params[:watch]
      @issues = Issue.where('watch=?', params[:watch])
    else
    @issues = Issue.all

SELECT  "issues".* FROM "issues" WHERE "issues"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    @issue = Issue.find(params[:id])

INSERT INTO "issues" ("title", "kind", "priority", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["title", "a"], ["kind", "Bug"], ["priority", "Trivial"], ["status", "New "], ["created_at", "2018-02-22 18:59:32.850209"], ["updated_at", "2018-02-22 18:59:32.850209"]]
---
  def create
    @issue = Issue.new(issue_params)

    respond_to do |format|
      if @issue.save